clarenceliu/Mplib/Toshaba/TMPM36B/cmsis_lib/lib/cmsis_boot/startup/startup_TMPM36B.c
};

//*****************************************************************************
//
//! \brief This is the code that gets called when the processor first
//! starts execution following a reset event.
//!
//! \param None.
//!
//! Only the absolutely necessary set is performed, after which the
//! application supplied main() routine is called.
//!
//! \return None.
//
//*****************************************************************************
void Default_ResetHandler(void)
{
    //
    // Initialize data and bss
    //
    unsigned char *pulSrc, *pulDest;

    //
    // Copy the data segment initializers from flash to SRAM
    //
    pulSrc = &_sidata;

    for(pulDest = &_sdata; pulDest < &_edata; )
    {
        *(pulDest++) = *(pulSrc++);
    }

    //
    // Zero fill the bss segment.
    //
    for(pulDest = &_sbss; pulDest < &_ebss; )
    {
        *(pulDest++) = 0;
    }

    //
    // Call the application's entry point.
    //
    SystemInit();
    main();
}

//*****************************************************************************
//
// Provide weak aliases for each Exception handler to the DefaultIntHandler.
// As they are weak aliases, any function with the same name will override
// this definition.
//
//*****************************************************************************

#pragma weak ResetHandler           = Default_ResetHandler
#pragma weak NMIIntHandler          = DefaultIntHandler
#pragma weak HardFaultIntHandler    = DefaultIntHandler
#pragma weak MemManageIntHandler    = DefaultIntHandler
#pragma weak BusFaultIntHandler     = DefaultIntHandler
#pragma weak UsageFaultIntHandler   = DefaultIntHandler
#pragma weak SVCIntHandler          = DefaultIntHandler
#pragma weak DebugMonIntHandler     = DefaultIntHandler
#pragma weak PendSVIntHandler       = DefaultIntHandler
#pragma weak SysTickIntHandler      = DefaultIntHandler

// External Interrupts
#pragma weak INT0_IRQHandler        = DefaultIntHandler //0:   Interrupt pin 0
#pragma weak INT1_IRQHandler        = DefaultIntHandler //1:   Interrupt pin 1
#pragma weak INT2_IRQHandler        = DefaultIntHandler //2:   Interrupt pin 2
#pragma weak INT3_IRQHandler        = DefaultIntHandler //3:   Interrupt pin 3
#pragma weak INT4_IRQHandler        = DefaultIntHandler //4:   Interrupt pin 4
#pragma weak INT5_IRQHandler        = DefaultIntHandler //5:   Interrupt pin 5
#pragma weak INT6_IRQHandler        = DefaultIntHandler //6:   Interrupt pin 6
#pragma weak INT7_IRQHandler        = DefaultIntHandler //7:   Interrupt pin 7
#pragma weak INT8_IRQHandler        = DefaultIntHandler //8:   Interrupt pin 8
#pragma weak INT9_IRQHandler        = DefaultIntHandler //9:   Interrupt pin 9
#pragma weak INTA_IRQHandler        = DefaultIntHandler //10:  Interrupt pin A
#pragma weak INTB_IRQHandler        = DefaultIntHandler //11:  Interrupt pin B
#pragma weak INTC_IRQHandler        = DefaultIntHandler //12:  Interrupt pin C
#pragma weak INTD_IRQHandler        = DefaultIntHandler //13:  Interrupt pin D
#pragma weak INTE_IRQHandler        = DefaultIntHandler //14:  Interrupt pin E
#pragma weak INTF_IRQHandler        = DefaultIntHandler //15:  Interrupt pin F
#pragma weak INTRX0_IRQHandler      = DefaultIntHandler //16:  Serial reception (channel.0)
#pragma weak INTTX0_IRQHandler      = DefaultIntHandler //17:  Serial transmission (channel.0)
#pragma weak INTRX1_IRQHandler      = DefaultIntHandler //18:  Serial reception (channel.1)
#pragma weak INTTX1_IRQHandler      = DefaultIntHandler //19:  Serial transmission (channel.1)
#pragma weak INTRX2_IRQHandler      = DefaultIntHandler //20:  Serial reception (channel.2)
#pragma weak INTTX2_IRQHandler      = DefaultIntHandler //21:  Serial transmission (channel.2)
#pragma weak INTRX3_IRQHandler      = DefaultIntHandler //22:  Serial reception (channel.3)
#pragma weak INTTX3_IRQHandler      = DefaultIntHandler //23:  Serial transmission (channel.3)
#pragma weak INTUART4_IRQHandler    = DefaultIntHandler //24:  FULL UART(channel.4)
#pragma weak INTUART5_IRQHandler    = DefaultIntHandler //25:  FULL UART(channel.5)
#pragma weak INTSBI0_IRQHandler     = DefaultIntHandler //26:  Serial bus interface 0
#pragma weak INTSBI1_IRQHandler     = DefaultIntHandler //27:  Serial bus interface 1
#pragma weak INTSBI2_IRQHandler     = DefaultIntHandler //28:  Serial bus interface 2
#pragma weak INTSSP0_IRQHandler     = DefaultIntHandler //29:  SPI serial interface 0
#pragma weak INTSSP1_IRQHandler     = DefaultIntHandler //30:  SPI serial interface 1
#pragma weak INTSSP2_IRQHandler     = DefaultIntHandler //31:  SPI serial interface 2
#pragma weak INTADHP_IRQHandler    = DefaultIntHandler //40:  Highest priority AD conversion complete interrupt (channel.A)
#pragma weak INTADM0_IRQHandler    = DefaultIntHandler //41:  AD conversion monitoring function interrupt 0(channel.A)
#pragma weak INTADM1_IRQHandler    = DefaultIntHandler //42:  AD conversion monitoring function interrupt 1(channel.A)
#pragma weak INTAD_IRQHandler      = DefaultIntHandler //43:  AD conversion interrupt(channel.A)
#pragma weak INTEMG0_IRQHandler     = DefaultIntHandler //48:  PMD0 EMG interrupt (MPT0)
#pragma weak INTPMD0_IRQHandler     = DefaultIntHandler //49:  PMD0 PWM interrupt (MPT0)
#pragma weak INTENC0_IRQHandler     = DefaultIntHandler //50:  PMD0 Encoder input interrupt (MPT0)
#pragma weak INTMTEMG0_IRQHandler   = DefaultIntHandler //54:  16-bit MPT0 IGBT EMG interrupt
#pragma weak INTMTPTB00_IRQHandler  = DefaultIntHandler //55:  16-bit MPT0 IGBT period/ TMRB compare match detection 0
#pragma weak INTMTTTB01_IRQHandler  = DefaultIntHandler //56:  16-bit MPT0 IGBT trigger/ TMRB compare match detection 1
#pragma weak INTMTCAP00_IRQHandler  = DefaultIntHandler //57:  16-bit MPT0 input capture 0
#pragma weak INTMTCAP01_IRQHandler  = DefaultIntHandler //58:  16-bit MPT0 input capture 1
#pragma weak INTMTEMG1_IRQHandler   = DefaultIntHandler //59:  16-bit MPT1 IGBT EMG interrupt
#pragma weak INTMTPTB10_IRQHandler  = DefaultIntHandler //60:  16-bit MPT1 IGBT period/ TMRB compare match detection 0
#pragma weak INTMTTTB11_IRQHandler  = DefaultIntHandler //61:  16-bit MPT1 IGBT trigger/ TMRB compare match detection 1
#pragma weak INTMTCAP10_IRQHandler  = DefaultIntHandler //62:  16-bit MPT1 input capture 0
#pragma weak INTMTCAP11_IRQHandler  = DefaultIntHandler //63:  16-bit MPT1 input capture 1
#pragma weak INTMTEMG2_IRQHandler   = DefaultIntHandler //64:  16-bit MPT2 IGBT EMG interrupt
#pragma weak INTMTPTB20_IRQHandler  = DefaultIntHandler //65:  16-bit MPT2 IGBT period/ TMRB compare match detection 0
#pragma weak INTMTTTB21_IRQHandler  = DefaultIntHandler //66:  16-bit MPT2 IGBT trigger/ TMRB compare match detection 1
#pragma weak INTMTCAP20_IRQHandler  = DefaultIntHandler //67:  16-bit MPT2 input capture 0
#pragma weak INTMTCAP21_IRQHandler  = DefaultIntHandler //68:  16-bit MPT2 input capture 1
#pragma weak INTMTEMG3_IRQHandler   = DefaultIntHandler //69:  16-bit MPT3 IGBT EMG interrupt
#pragma weak INTMTPTB30_IRQHandler  = DefaultIntHandler //70:  16-bit MPT3 IGBT period/ TMRB compare match detection 0
#pragma weak INTMTTTB31_IRQHandler  = DefaultIntHandler //71:  16-bit MPT3 IGBT trigger/ TMRB compare match detection 1
#pragma weak INTMTCAP30_IRQHandler  = DefaultIntHandler //72:  16-bit MPT3 input capture 0
#pragma weak INTMTCAP31_IRQHandler  = DefaultIntHandler //73:  16-bit MPT3 input capture 1
#pragma weak INTRMCRX_IRQHandler    = DefaultIntHandler //74:  Remote Controller reception interrupt
#pragma weak INTTB0_IRQHandler      = DefaultIntHandler //75:  16-bit TMRB_0 match detection 0
#pragma weak INTCAP00_IRQHandler    = DefaultIntHandler //76:  16-bit TMRB_0 input capture 00
#pragma weak INTCAP01_IRQHandler    = DefaultIntHandler //77:  16-bit TMRB_0 input capture 01
#pragma weak INTTB1_IRQHandler      = DefaultIntHandler //78:  16-bit TMRB_1 match detection 1
#pragma weak INTCAP10_IRQHandler    = DefaultIntHandler //79:  16-bit TMRB_1 input capture 10
#pragma weak INTCAP11_IRQHandler    = DefaultIntHandler //80:  16-bit TMRB_1 input capture 11
#pragma weak INTTB2_IRQHandler      = DefaultIntHandler //81:  16-bit TMRB_2 match detection 2
#pragma weak INTCAP20_IRQHandler    = DefaultIntHandler //82:  16-bit TMRB_2 input capture 20
#pragma weak INTCAP21_IRQHandler    = DefaultIntHandler //83:  16-bit TMRB_2 input capture 21
#pragma weak INTTB3_IRQHandler      = DefaultIntHandler //84:  16-bit TMRB_3 match detection 3
#pragma weak INTCAP30_IRQHandler    = DefaultIntHandler //85:  16-bit TMRB_3 input capture 30
#pragma weak INTCAP31_IRQHandler    = DefaultIntHandler //86:  16-bit TMRB_3 input capture 31
#pragma weak INTTB4_IRQHandler      = DefaultIntHandler //87:  16-bit TMRB_4 match detection 4
#pragma weak INTCAP40_IRQHandler    = DefaultIntHandler //88:  16-bit TMRB_4 input capture 40
#pragma weak INTCAP41_IRQHandler    = DefaultIntHandler //89:  16-bit TMRB_4 input capture 41
#pragma weak INTTB5_IRQHandler      = DefaultIntHandler //90:  16-bit TMRB_5 match detection 5
#pragma weak INTCAP50_IRQHandler    = DefaultIntHandler //91:  16-bit TMRB_5 input capture 50
#pragma weak INTCAP51_IRQHandler    = DefaultIntHandler //92:  16-bit TMRB_5 input capture 51
#pragma weak INTTB6_IRQHandler      = DefaultIntHandler //93:  16-bit TMRB_6 match detection 6
#pragma weak INTCAP60_IRQHandler    = DefaultIntHandler //94:  16-bit TMRB_6 input capture 60
#pragma weak INTCAP61_IRQHandler    = DefaultIntHandler //95:  16-bit TMRB_6 input capture 61
#pragma weak INTTB7_IRQHandler      = DefaultIntHandler //96:  16-bit TMRB_7 match detection 7
#pragma weak INTCAP70_IRQHandler    = DefaultIntHandler //97:  16-bit TMRB_7 input capture 70
#pragma weak INTCAP71_IRQHandler    = DefaultIntHandler //98:  16-bit TMRB_7 input capture 71
#pragma weak INTRTC_IRQHandler      = DefaultIntHandler //99:  RTC(Real time clock) interrupt
#pragma weak INTDMAAD_IRQHandler   = DefaultIntHandler //100: DMA_ADC_A conversion end
#pragma weak INTDMASPR0_IRQHandler  = DefaultIntHandler //104: DMA_SSP_0 reception / DMA_I2C SIO_0
#pragma weak INTDMASPT0_IRQHandler  = DefaultIntHandler //105: DMA_SSP_0 transmission
#pragma weak INTDMASPR1_IRQHandler  = DefaultIntHandler //106: DMA_SSP_1 reception
#pragma weak INTDMASPT1_IRQHandler  = DefaultIntHandler //107: DMA_SSP_1 transmission
#pragma weak INTDMASPR2_IRQHandler  = DefaultIntHandler //108: DMA_SSP_2 reception
#pragma weak INTDMASPT2_IRQHandler  = DefaultIntHandler //109: DMA_SSP_2 transmission
#pragma weak INTDMAUTR4_IRQHandler  = DefaultIntHandler //110: DMA_FUART_4 reception
#pragma weak INTDMAUTT4_IRQHandler  = DefaultIntHandler //111: DMA_FUART_4 transmission
#pragma weak INTDMAUTR5_IRQHandler  = DefaultIntHandler //112: DMA_FUART_5 reception
#pragma weak INTDMAUTT5_IRQHandler  = DefaultIntHandler //113: DMA_FUART_5 transmission
#pragma weak INTDMARX0_IRQHandler   = DefaultIntHandler //114: DMA_SIO/ UART_0 reception
#pragma weak INTDMATX0_IRQHandler   = DefaultIntHandler //115: DMA_SIO/ UART_0 transmission
#pragma weak INTDMARX1_IRQHandler   = DefaultIntHandler //116: DMA_SIO/ UART_1 reception
#pragma weak INTDMATX1_IRQHandler   = DefaultIntHandler //117: DMA_SIO/ UART_1 transmission
#pragma weak INTDMARX2_IRQHandler   = DefaultIntHandler //118: DMA_SIO/ UART_2 reception
#pragma weak INTDMATX2_IRQHandler   = DefaultIntHandler //119: DMA_SIO/ UART_2 transmission
#pragma weak INTDMARX3_IRQHandler   = DefaultIntHandler //120: DMA_SIO/ UART_3 reception
#pragma weak INTDMATX3_IRQHandler   = DefaultIntHandler //121: DMA_SIO/ UART_3 transmission
#pragma weak INTDMASBI1_IRQHandler  = DefaultIntHandler //122: DMA_I2C/ SIO_1
#pragma weak INTDMASBI2_IRQHandler  = DefaultIntHandler //123: DMA_I2C/ SIO_2
#pragma weak INTDMATB_IRQHandler    = DefaultIntHandler //124: 16-bit TMRB_0-4 match detection
#pragma weak INTDMARQ_IRQHandler    = DefaultIntHandler //125: DMA request pin
#pragma weak INTDMAAERR_IRQHandler  = DefaultIntHandler //126: DMA_A error transfer interrupt
#pragma weak INTDMABERR_IRQHandler  = DefaultIntHandler //127: DMA_B error transfer interrupt

//*****************************************************************************
//
//! \brief This is the code that gets called when the processor receives an
//! unexpected interrupt.
//!
//! \param None.
//!
//! This simply enters an infinite loop, preserving the system state for
//! examination by a debugger.
//!
//! \return None.
//*****************************************************************************
static void DefaultIntHandler(void)
{
    //
    // Go into an infinite loop.
    //
    while (1)
    {
    }
}

